app/controllers/students_controller.rb

INSERT INTO "students" ("name", "register_number", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Fulano"], ["register_number", "123456"], ["status", 1], ["created_at", "2016-04-30 19:21:07.664966"], ["updated_at", "2016-04-30 19:21:07.664966"]]
---
 def create
    @student = Student.new(student_params)
    if @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "students" SET "register_number" = $1, "updated_at" = $2 WHERE "students"."id" = $3  [["register_number", "1234568"], ["updated_at", "2016-04-30 22:14:47.836010"], ["id", 1]]
---
  def update
  	@student = Student.find(params[:id])
  	if @student.update_attributes(student_params)